Repository: abdel792/addonCompatibilityUpdate
Catalog: addon/locale/*/LC_MESSAGES/nvda.po
Languages: ar, fr

source: Change year com&patibility for add-ons...
ar: تغيير سَ&نَة التوافق الخاصة بالإضافات...
fr: Changer la com&patibilité de l'année pour les extensions...

source: Allows you to choose your year compatibility for your add-ons
ar: يتيح لك اختيار سَنَة التوفق مع الإضافات المثبتة لديك
fr: Vous permet de choisir votre année de compatibilité pour vos extensions

source: Year compatibility dialog is already open.
ar: هناك مربع حوار توافق السَنَة مفتوح سلفا
fr: La boîte de dialogue de compatibilité des années est déjà ouverte.

source: Display the year compatibility settings dialog box.
ar: عرض إعدادات محاورة توافق السَنَة.
fr: Affiche la boîte de dialogue des paramètres de compatibilité de l'année.

source: List of years to choose for add-on compatibility
ar: قائمة السنوات لاختيار التوافق مع الإضافات
fr: Liste des années à choisir pour la compatibilité des extensions

source: Year compatibility for add-ons:
ar: توافق السَنَة مع الإضافات :
fr: Compatibilité de l'année pour les extensions :

source: You have installed the updateAddonsCompatibility add-on which is incompatible with this one. Do you want to uninstall this old version?
ar: لقد قمْتَ بتثبيت إضافة updateAddonsCompatibility التي لا تتوافق مع هذا الإصدار الجديد. هل تريد إلغاء التثبيت القديم ؟
fr: Vous avez installé l'extension updateAddonsCompatibility qui est incompatible avec cette nouvelle version. Voulez-vous désinstaller cette ancienne version ?

source: Uninstall incompatible version
ar: قُمْ بإلغاء تثبيت الإصدار غير المتوافق
fr: Désinstaller une version incompatible

source: Add-om compatibility update
ar: تحديث توافق الإضافات
fr: Mise à jour de compatibilité des extensions

source: This add-on allows you to update the value of the lastTestedNVDAVersion key in the manifest file of each of the installed add-ons so that it is compatible with a year chosen from a list of choices.
ar: هذه الإضافة تسمح بتحديث قيمة مفتاح lastTestedNVDAVersion في ملف البيانات لكل الإضافات المثبتة بحيث تكون متوافقة مع السَنَة المختارة ضمن القائمة المعروضة.
fr: Cette extension permet de mettre à jour la valeur de la clé lastTestedNVDAVersion dans le fichier manifeste de chacune des extensions installées afin qu'elles soient compatibles avec une année choisie dans une liste.
